const Asena = require('../events');
const { MessageType, MessageOptions, Mimetype } = require('@adiwajshing/baileys');
const fs = require('fs');
const axios = require('axios');
const Config = require('../config');

if (Config.WORKTYPE == 'private') {
    
Asena.addCommand({pattern: 'aliv', fromMe: true,dontAddCommandList: true}, (async (message, match) => {

    var r_text = new Array ();    
r_text[0] = "•°✪⃝മരണം വരെ കുടെ കണ്ണും എന്ന് പറഞ്ഞവർ ഇപ്പെꪆ എന്റെ മരണത്ത᭄ന് വേണ്ട᭄ കꪆത്ത᭄ര᭄ക്കുന്നു  ⃟★⃪͢＿🍃࿐⃝ ➢";
r_text[1] = "⏤͟͟͞͞✯✮⃝➻❥ ആത്മꪆർത്ഥമꪆയ᭄ നമ്മളെ സ്നേഹ᭄ക്കꪆൻ ഒരꪆൾ ഉണ്ടꪆയꪆൽ...♥️🌎😘 അത് ആയ᭄ര᭄ക്കും ജീവ᭄തത്ത᭄ലെ ഏറ്റവും വല᭄യ ഭꪆഗ്യം♥️🖇️🔐";
r_text[2] = "⋆⏤͟͟͞͞✪⃝🍃സ്നേഹ᭄ക്കꪆ൵ അറിയꪆം സ്നേഹം അഭ᭄നയ᭄ക്കാ൵ അറയ᭄ല്ല ച᭄ലപ്പോ അതꪆയര᭄ക്കും എന്റെ ഏറ്റവും വല᭄യ പരꪆജയവും🕊️🍃࿐⃝ ➢";
r_text[3] = "꧁കൂട്ടമꪆയ᭄ ന᭄ന്ന് തകർക്കꪆ൵ ആണ് ഉദ്ദേശ൭മക᭄ൽ...ഒറ്റക് ന᭄ന്ന് ൭പꪆരുതꪆ൵ ത൭൬യꪆണ്  എ൭ന്റ ത്᭄രുമꪆന....꧂😼";
r_text[4] = "⏤͟͟͞͞🍃🐲☘️_എന᭄ക്ക് ച᭄ര᭄ക്കꪆൻ കഴ᭄യുന്ന  കꪆലത്തോളം  എന്റെ പരꪆജയം★᭄ꦿ᭄ꦿ ആസ്വദ᭄ക്കꪆൻ നിങ്ങൾക്ക് കഴയ᭄ല്ല 🇦🇱⃝ 🇦🇴⏤͟͟͞͞";
r_text[5] = "۝⃝⃤നീ കെꪆലവ᭄ള᭄ മുഴക്ക᭄  പേꪆര᭄ന് ഇറങ്ങുമ്പെꪆൾ ന᭄ന്റെ രക്തത്ത᭄ൽ എന്റെ നꪆമം കുറ᭄ക്കꪆൻ ന᭄ന്റെ എത᭄രꪆള᭄ ആയ᭄ ഞꪆൻ ഉണ്ടꪆവും "; 
r_text[6] = "♥︎വ᭄ടാതെ  ന᭄ മുറുകെ  പ᭄ട᭄ക്കുമെങ്ക᭄ൽ  വ᭄ട്ടു പോകാതെ ഞാൻ  കൂടെ ഉണ്ടാവും ന᭄ൻ ന᭄ഴലുപോലെ  മണ്ണോടു  ചേരും വരെ✪⃝🤍"; 
r_text[7] = "❝ 🙂🌿തന᭄ച്ചꪆക്ക᭄ പോയത᭄ൽ സങ്കടമ᭄ല്ല.. മനസ്സ᭄ലꪆക്കꪆതെ പോയത᭄ലꪆണ് വ᭄ഷമം...🍂❞★＿❀🥲💯"; 
r_text[8] = "★ദേവയുക്തം ൭൭പശച്യം യഥꪆ രേꪆഗ്യꪆയ കൽപ്പ൭ത സചയ᭄വ വ᭄ഷജꪆംശ്രേഷ്‌ടേꪆ യേꪆഗേദ്യേꪆയ ꪶപമേꪆജ൭യ........★🐲‼️ 🤍🍷_*mass*_"; 
r_text[9] = "*എന᭄ക്ക᭄ട്ടു പണ᭄യꪆൻ വരുമ്പോ അത് നന്നꪆയ᭄ട്ട് 💯 ആലോജ᭄ച്ച᭄ട്ടു വേണം  കꪆരണം എന്ത് ക᭄ട്ട᭄യാലും അതു ത᭄ര᭄ച്ചു കൊടുത്ത ശീലം ക᭄ട്ട᭄യത᭄ന്റെ ഇരട്ട᭄തരു"; 
r_text[10] = "_നꪆ൭ള_ഞꪆന᭄_ഭൂമ᭄യ᭄ൽ ഇ൭ല്ലങ്ക᭄ലും_നീ_അറ᭄യുക. . . ഈ_ഭൂമ᭄യ᭄ൽ_ഞꪆ൵_ന᭄ന്നേꪆളം_മ൭റ്റꪆന്ന᭄൭നയും_സ്നേഹ᭄ച്ച᭄ട്ട᭄ല്ല★..🍃🌸🤍."; 
r_text[11] = "ജയ᭄ച്ചേ തീരു എന്ന വꪆശ᭄൭യꪆന്നും ഇല്ല 😚 പക്ഷെ  തോൽപ്പ᭄ച്ചേ തീരു എന്ന് വꪆശ᭄ പ᭄ട᭄ക്കുന്നവർക്ക് മുന്ന᭄൭ലꪆന്ന് ജയ᭄ച്ചു കാണിച്ചിരിക്കും ﮩ٨ـﮩﮩ٨ـ♡ﮩ٨"; 
r_text[12] = "🌿ആരു൭ടയുംകണ്ണ്..ന᭄റച്ച്  ഒന്നും സ്വന്തം അക᭄ട്ട᭄ല്ല😇🕊️ സ്വന്തം കണ്ണ് ♪ ന᭄റച്ച്  എല്ലꪆഠ വ᭄ട്ടു..൭കꪆടുത്ത᭄൭ട ഒള്ളു🍃💔"; 
r_text[13] = "✦҈͜͡➳✮⃝ആയ᭄രം പൂക്കൾക്ക᭄ടയ᭄ൽ നിന്നും ഞꪆനെꪆരു പൂവ᭄നെ ത᭄രഞ്ഞെടുത്തു അത് ഇന᭄ വാട᭄യാലും കൊഴ᭄ഞ്ഞാലും എന്റെ മനസ്സ് മറ്റൊന്ന᭄നെയും ആഗ്രഹ᭄ക്ക᭄ല്ല"; 
var i = Math.floor(14*Math.random())

await message.sendMessage(r_text[i]);

 }));
}

else if (Config.WORKTYPE == 'public') {
    
Asena.addCommand({pattern: 'aliv', fromMe: false,dontAddCommandList: true}, (async (message, match) => {

    var r_text = new Array ();    
r_text[0] = "•°✪⃝മരണം വരെ കുടെ കണ്ണും എന്ന് പറഞ്ഞവർ ഇപ്പെꪆ എന്റെ മരണത്ത᭄ന് വേണ്ട᭄ കꪆത്ത᭄ര᭄ക്കുന്നു  ⃟★⃪͢＿🍃࿐⃝ ➢";
r_text[1] = "⏤͟͟͞͞✯✮⃝➻❥ ആത്മꪆർത്ഥമꪆയ᭄ നമ്മളെ സ്നേഹ᭄ക്കꪆൻ ഒരꪆൾ ഉണ്ടꪆയꪆൽ...♥️🌎😘 അത് ആയ᭄ര᭄ക്കും ജീവ᭄തത്ത᭄ലെ ഏറ്റവും വല᭄യ ഭꪆഗ്യം♥️🖇️🔐";
r_text[2] = "⋆⏤͟͟͞͞✪⃝🍃സ്നേഹ᭄ക്കꪆ൵ അറിയꪆം സ്നേഹം അഭ᭄നയ᭄ക്കാ൵ അറയ᭄ല്ല ച᭄ലപ്പോ അതꪆയര᭄ക്കും എന്റെ ഏറ്റവും വല᭄യ പരꪆജയവും🕊️🍃࿐⃝ ➢";
r_text[3] = "꧁കൂട്ടമꪆയ᭄ ന᭄ന്ന് തകർക്കꪆ൵ ആണ് ഉദ്ദേശ൭മക᭄ൽ...ഒറ്റക് ന᭄ന്ന് ൭പꪆരുതꪆ൵ ത൭൬യꪆണ്  എ൭ന്റ ത്᭄രുമꪆന....꧂😼";
r_text[4] = "⏤͟͟͞͞🍃🐲☘️_എന᭄ക്ക് ച᭄ര᭄ക്കꪆൻ കഴ᭄യുന്ന  കꪆലത്തോളം  എന്റെ പരꪆജയം★᭄ꦿ᭄ꦿ ആസ്വദ᭄ക്കꪆൻ നിങ്ങൾക്ക് കഴയ᭄ല്ല 🇦🇱⃝ 🇦🇴⏤͟͟͞͞";
r_text[5] = "۝⃝⃤നീ കെꪆലവ᭄ള᭄ മുഴക്ക᭄  പേꪆര᭄ന് ഇറങ്ങുമ്പെꪆൾ ന᭄ന്റെ രക്തത്ത᭄ൽ എന്റെ നꪆമം കുറ᭄ക്കꪆൻ ന᭄ന്റെ എത᭄രꪆള᭄ ആയ᭄ ഞꪆൻ ഉണ്ടꪆവും "; 
r_text[6] = "♥︎വ᭄ടാതെ  ന᭄ മുറുകെ  പ᭄ട᭄ക്കുമെങ്ക᭄ൽ  വ᭄ട്ടു പോകാതെ ഞാൻ  കൂടെ ഉണ്ടാവും ന᭄ൻ ന᭄ഴലുപോലെ  മണ്ണോടു  ചേരും വരെ✪⃝🤍"; 
r_text[7] = "❝ 🙂🌿തന᭄ച്ചꪆക്ക᭄ പോയത᭄ൽ സങ്കടമ᭄ല്ല.. മനസ്സ᭄ലꪆക്കꪆതെ പോയത᭄ലꪆണ് വ᭄ഷമം...🍂❞★＿❀🥲💯"; 
r_text[8] = "★ദേവയുക്തം ൭൭പശച്യം യഥꪆ രേꪆഗ്യꪆയ കൽപ്പ൭ത സചയ᭄വ വ᭄ഷജꪆംശ്രേഷ്‌ടേꪆ യേꪆഗേദ്യേꪆയ ꪶപമേꪆജ൭യ........★🐲‼️ 🤍🍷_*mass*_"; 
r_text[9] = "*എന᭄ക്ക᭄ട്ടു പണ᭄യꪆൻ വരുമ്പോ അത് നന്നꪆയ᭄ട്ട് 💯 ആലോജ᭄ച്ച᭄ട്ടു വേണം  കꪆരണം എന്ത് ക᭄ട്ട᭄യാലും അതു ത᭄ര᭄ച്ചു കൊടുത്ത ശീലം ക᭄ട്ട᭄യത᭄ന്റെ ഇരട്ട᭄തരു"; 
r_text[10] = "_നꪆ൭ള_ഞꪆന᭄_ഭൂമ᭄യ᭄ൽ ഇ൭ല്ലങ്ക᭄ലും_നീ_അറ᭄യുക. . . ഈ_ഭൂമ᭄യ᭄ൽ_ഞꪆ൵_ന᭄ന്നേꪆളം_മ൭റ്റꪆന്ന᭄൭നയും_സ്നേഹ᭄ച്ച᭄ട്ട᭄ല്ല★..🍃🌸🤍."; 
r_text[11] = "ജയ᭄ച്ചേ തീരു എന്ന വꪆശ᭄൭യꪆന്നും ഇല്ല 😚 പക്ഷെ  തോൽപ്പ᭄ച്ചേ തീരു എന്ന് വꪆശ᭄ പ᭄ട᭄ക്കുന്നവർക്ക് മുന്ന᭄൭ലꪆന്ന് ജയ᭄ച്ചു കാണിച്ചിരിക്കും ﮩ٨ـﮩﮩ٨ـ♡ﮩ٨"; 
r_text[12] = "🌿ആരു൭ടയുംകണ്ണ്..ന᭄റച്ച്  ഒന്നും സ്വന്തം അക᭄ട്ട᭄ല്ല😇🕊️ സ്വന്തം കണ്ണ് ♪ ന᭄റച്ച്  എല്ലꪆഠ വ᭄ട്ടു..൭കꪆടുത്ത᭄൭ട ഒള്ളു🍃💔"; 
r_text[13] = "✦҈͜͡➳✮⃝ആയ᭄രം പൂക്കൾക്ക᭄ടയ᭄ൽ നിന്നും ഞꪆനെꪆരു പൂവ᭄നെ ത᭄രഞ്ഞെടുത്തു അത് ഇന᭄ വാട᭄യാലും കൊഴ᭄ഞ്ഞാലും എന്റെ മനസ്സ് മറ്റൊന്ന᭄നെയും ആഗ്രഹ᭄ക്ക᭄ല്ല"; 
var i = Math.floor(14*Math.random())

await message.sendMessage(r_text[i]);

 }));
}
   
